{"text": "Construction Admin Assistant COMAYDA M SDN BHD Kota Kinabalu,RESPONSIBILITIES To perform data entry. To provide clerical and administrative support functions such as recording, photocopying, scanning and filing of documents. To maintain an efficient filing system of the department. To perform other related tasks as assigned by the Management. REQUIREMENTS Possess at least SPM STPM or equivalent. Fresh graduates are encouraged to apply. Required languagess English and Bahasa Malaysia. Computer literate. Meticulous and able to work with minimum supervision. BENEFITS Salary Range RM1,100 RM1,400"}
{"text": "APAC HR Services Team Leader (6-months Contract),The APAC HR Services Team Leader (6-months Contract) is responsible for overseeing the daily workloads of the HR Services function and delivering HR services efficiently and effectively for Asia through prompt and accurate processing of requests in accordance with Service Level Agreement (SLA) and in compliance with Company policies & procedures, statutory and legal requirements.  Regional experience is preferred but not mandatory. Customer First approach in all aspects of work. High level of good communication and influencing skills. Results driven and takes responsibility for all work. High attention to detail and accurate in all work. High level and broad thinking approach to continuous improvement and being solution focused. Are you a Brightstar? At Brightstar, we handle every stage of a mobile devices lifecycle for our customers-from the moment its manufactured to trade in and re-sale, and everything in between. This industry moves fast. But so do we. Whats innovative today might become outdated tomorrow, so we have to be able to see the big picture and sweat the small details. Doing that successfully takes trust, teamwork and a knack for making the complicated simple. Were looking for creative, quick and relentless talent to join the team. Are you one of us?"}
 {"text": "Air Import Customer Service, Job Description Ensure smooth and timely freight process flow. Ensure accurate and timely data entry into our operating system. Track and trace Air Import files as required. This can be either internally via exp.o or externally via airline websites or by telephone to airline offices. Ensure timely delivery of freight to customers for Import shipments. Ensure documents are timely sent to customer or broker for customs purposes. Ensure accurate and timely client and vendors billing. Interact with our customers in arranging their international shipments, meeting customer service standards. Contribute to maintain strong relationships with vendors (airlines, trucking companies, and others). Meet compliance at all times to regulations. This includes internal policies and procedures such as Operational Process Standards (OPS) and external government regulations or customers policies / requirements. Understand department process flow, constantly looking for areas of improved efficiency. Employee Stock Purchase Plan Training and Personnel Development Program All your information will be kept confidential according to EEO guidelines."}